W7D2/MusicApp/app/views/bands/show.html.erb

    <ul>
        <% @band.albums.each do |album| %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 2]]