W7D2/MusicApp/app/controllers/albums_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @album = Album.find_by(id: params[:id])

SELECT "bands".* FROM "bands"
---
    def new
        @album = Album.new(band_id: params[:band_id])
        @bands = Band.all

INSERT INTO "albums" ("title", "year", "band_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Abbey Road"], ["year", 1968], ["band_id", 2], ["created_at", "2020-05-19 23:48:57.800363"], ["updated_at", "2020-05-19 23:48:57.800363"]]
---
    def create
        @album = Album.new(album_params)

        if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "bands".* FROM "bands"
---
    def edit
        @album = Album.find_by(id: params[:id])
        @bands = Band.all

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "year" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["year", 1969], ["updated_at", "2020-05-19 23:55:21.969675"], ["id", 1]]
---
    def update
        @album = Album.find_by(id: params[:id])

        if @album.update(album_params)