W7D3/goal_app/app/controllers/users_controller.rb

        def update
            @user = User.find(params[:id])

            if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "newusername"], ["password_digest", "$2a$12$63Ehw0dEkcqlp8YVj5tmS.nDhCk674IcxcB/eiXh8n2MqdgUmljpm"], ["updated_at", "2020-05-20 22:18:50.405855"], ["id", 23]]