W7D5/reddit_on_rails/app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def show
        @comment = Comment.find_by(id: params[:id])

INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at", "parent_comment_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "I disagree!"], ["author_id", 4], ["post_id", 2], ["created_at", "2020-05-23 22:57:27.471345"], ["updated_at", "2020-05-23 22:57:27.471345"], ["parent_comment_id", 1]]
---
    def create
        debugger
        @comment = Comment.new(comment_params)
        @comment.author_id = current_user.id
        @comment.post_id ||= @comment.parent_comment.post_id

        if @comment.save