W7D5/reddit_on_rails/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @post = Post.new(post_params)
        @post.author_id = current_user.id

        if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "JK this is the content"], ["updated_at", "2020-05-22 19:10:04.989463"], ["id", 1]]
---
    def update
        @post = Post.find_by(id: params[:id])

        if @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def require_post_author
        @post = Post.find(:id)