W7D5/reddit_on_rails/app/controllers/subs_controller.rb

    def update
        @sub = Sub.find_by(id: params[:id])

        if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "First sub! (Edited)"], ["updated_at", "2020-05-22 18:14:43.715654"], ["id", 1]]

    def require_moderator
        @sub = Sub.find_by(id: params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]