W6D3 - D4/first_routes_controllers/app/controllers/artworks_controller.rb

    def index
        user = User.includes(:artworks, :shared_artworks).find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1  [["id", 10]]

    def create
        artwork = Artwork.new(helper_params)
        if artwork.save
---
INSERT INTO "artworks" ("image_url", "artist_id", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["image_url", "ww.ghf.com"], ["artist_id", 7], ["title", "Glass Half Full"], ["created_at", "2020-05-14 17:04:52.035483"], ["updated_at", "2020-05-14 17:04:52.035483"]]

    def destroy
        artwork = Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def update
        artwork = Artwork.find(params[:id])
        if artwork.update(helper_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["image_url", "www.ghf.com"], ["updated_at", "2020-05-14 17:08:27.671722"], ["id", 4]]