W6D3 - D4/first_routes_controllers/app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 9]]
SELECT "comments".* FROM "comments"
---
    def index
        if params[:user_id]
            user = User.includes(:comments).find(params[:user_id])
            comments = user.comments
        elsif params[:artwork_id]
            artwork = Artwork.includes(:comments).find(params[:artwork_id])
            comments = artwork.comments
        else
            comments = Comment.all

INSERT INTO "comments" ("body", "author_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "This is the best art"], ["author_id", 12], ["artwork_id", 9], ["created_at", "2020-05-14 20:36:04.303873"], ["updated_at", "2020-05-14 20:36:04.303873"]]
---
    def create
        comment = Comment.new(comment_params)
        if comment.save