W6D3 - D4/first_routes_controllers/app/controllers/likes_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
---
    def index
        if params[:comment_id]
            comment = Comment.includes(:likes).find(params[:comment_id])
            likes = comment.likes
        elsif params[:artwork_id]
            artwork = Artwork.includes(:likes).find(params[:artwork_id])
            likes = artwork.likes
        else
            user = User.includes(:likes).find(params[:user_id])

INSERT INTO "likes" ("likeable_id", "likeable_type", "liker_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["likeable_id", 15], ["likeable_type", "Comment"], ["liker_id", 25], ["created_at", "2020-05-14 23:19:29.506551"], ["updated_at", "2020-05-14 23:19:29.506551"]]
---
    def create
        like = Like.new(like_params)
        if like.save

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 7]]
---
    def destroy
        like = Like.find(params[:id])
        like.destroy