W6D3 - D4/first_routes_controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (users.username ILIKE '%be#%')
---
    def index
        if params[:username]
            users = User.where("users.username ILIKE ?", "%#{params[:username]}%")
        else
            users = User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Carlos"], ["email", "carlos@los.com"], ["created_at", "2020-05-13 23:12:06.903349"], ["updated_at", "2020-05-13 23:12:06.903349"]]
---
    def create
        user = User.new(helper_params)
        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "ben@benji.com"], ["updated_at", "2020-05-13 23:09:05.690941"], ["id", 1]]
---
    def update
        user = User.find(params[:id])
        if user.update(helper_params)