W7D5/reddit_on_rails/app/views/posts/show.html.erb

<ul>
    <% @post.subs.each do |sub| %>
---
SELECT "subs".* FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 1]]

<ul>
    <% @post.comments.where(parent_comment_id: nil).each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."parent_comment_id" IS NULL  [["post_id", 2]]