W7D5/reddit_on_rails/app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
---
<ul>
    <% @post.comments.each do |comment| %>